sf7ru/arsenal/beans/src/hal/stm32/f7xx/src/Stm32f7xxUart_freertos.c
// ***************************************************************************
// TITLE
//
// PROJECT
//
// ***************************************************************************
//
// FILE
//      $Id$
// HISTORY
//      $Log$
// ***************************************************************************



#include <stm32f7xx_hal.h>
#include <stm32f7xx_hal_conf.h>
#include <HalPlatformDefs.h>
#include <serial.h>
#include "stm32f7xx_ll_dma.h"
#include "stm32f7xx_ll_bus.h"
#include "stm32f7xx_ll_usart.h"
#include "stm32f7xx.h"

//#define DISABLE_UART_DMA

// ***************************************************************************
// NOTE
//      Для UART реализован неблокирующий IT-режим, для SmartCard
//      режим блокирующий
// ***************************************************************************

// ---------------------------------------------------------------------------
// ------------------------------- DEFINITIONS -------------------------------
// -----|-------------------|-------------------------------------------------

#define UARTDEFS_NUM        (sizeof(globalUarts) / sizeof(UARTDEF))


#ifdef HAL_UART_MODULE_ENABLED

#include <ringbuff.h>


#include <serial.h>
#include <arsenal.h>
#include <stdint.h>

#include <axdata.h>
#include <axtime.h>

#include <customboard.h>
#include <stm32f7xx_hal_conf.h>

#include <FreeRTOS.h>
#include <task.h>


#ifndef CBRD_UART_IN_BUFF_SZ
#define CBRD_UART_IN_BUFF_SZ    256
#endif

//#include <stm32f7xx_ll_lpuart.h>
#include <stm32f7xx_hal_uart.h>
#include <stm32f7xx_hal_smartcard.h>


// ---------------------------------------------------------------------------
// ------------------------------- DEFINITIONS -------------------------------
// -----|-------------------|-------------------------------------------------


#define MODE_UART               0
#define MODE_SMARTCARD          1

// ---------------------------------------------------------------------------
// ---------------------------------- DATA -----------------------------------
// -----|-------------------|-------------------------------------------------


typedef struct tag_UARTDEF
{
    USART_TypeDef *         addr;
    PRINGBUFF               buff;
    UINT                    mode;
    UART_HandleTypeDef      def;
    SMARTCARD_HandleTypeDef scdef;
    DMA_Stream_TypeDef*     dmaStream;
    UINT                    dmaIrqN;
    UINT                    dmaChannel;
    DMA_HandleTypeDef       dmarx;
    PU8                     dmarxbuff;
    UINT                    old_pos;
    TaskHandle_t            xTaskToNotify;
} UARTDEF, * PUARTDEF;

static UARTDEF globalUarts[  ] =
{
    { USART1, nil, 0,  { 0 }, { 0 }, 0, 0, 0, { 0 }, 0, 0, 0 },

#if (!defined(DISABLE_UART_DMA))
    { USART2, nil, 0,  { 0 }, { 0 }, DMA1_Stream5, DMA1_Stream5_IRQn, DMA_CHANNEL_4, { 0 }, 0, 0, 0 },
#else
     { USART2, nil, 0,  { 0 }, { 0 }, 0, 0, 0, { 0 }, 0, 0, 0 },
#endif

#ifdef USART3
#if (!defined(DISABLE_UART_DMA))
    { USART3, nil, 0,  { 0 }, { 0 }, DMA1_Stream1, DMA1_Stream1_IRQn, DMA_CHANNEL_4, { 0 }, 0, 0, 0 },
#else
    { USART3, nil, 0,  { 0 }, { 0 }, 0, 0, 0, { 0 }, 0, 0, 0 },
#endif
#else
    { nil, nil, 0,  { 0 }, { 0 }, 0, 0, 0, { 0 }, 0, 0, 0 },
#endif

#ifdef UART4
#if (!defined(DISABLE_UART_DMA))
    { UART4,  nil, 0,  { 0 }, { 0 }, DMA1_Stream2, DMA1_Stream2_IRQn, DMA_CHANNEL_4, { 0 }, 0, 0, 0 },
#else
    { UART4,  nil, 0,  { 0 }, { 0 }, 0, 0, 0, { 0 }, 0, 0, 0 },
#endif
#else
    { nil, nil, 0,  { 0 }, { 0 }, 0, 0, 0, { 0 }, 0, 0, 0 },
#endif

#ifdef UART5
#if (!defined(DISABLE_UART_DMA))
    { UART5,  nil, 0,  { 0 }, { 0 }, DMA1_Stream0, DMA1_Stream0_IRQn, DMA_CHANNEL_4, { 0 }, 0, 0, 0 },
#else
    { UART5,  nil, 0,  { 0 }, { 0 }, 0, 0, 0, { 0 }, 0, 0, 0 },
#endif
#else
    { nil, nil, 0,  { 0 }, { 0 }, 0, 0, 0, { 0 }, 0, 0, 0 },
#endif

    { USART6, nil, 0,  { 0 }, { 0 }, 0, 0, 0, { 0 }, 0, 0, 0 },
};

// ---------------------------------------------------------------------------
// -------------------------------- FUNCTIONS --------------------------------
// -----------------|---------------------------(|------------------|---------


PUARTDEF getUartDefByDma(DMA_HandleTypeDef * dmahf)
{
    PUARTDEF result = nil;

    for (int i = 0; !result && (i < UARTDEFS_NUM); i++)
    {
        if (&globalUarts[i].dmarx == dmahf)
        {
            result = &globalUarts[i];
        }
    }

    return result;
}

PUARTDEF getUartDefByHandle(UART_HandleTypeDef * huart)
{
    PUARTDEF result = nil;

    for (int i = 0; !result && (i < UARTDEFS_NUM); i++)
    {
        if (&globalUarts[i].def.Instance == huart->Instance)
        {
            result = &globalUarts[i];
        }
    }

    return result;
}

void process_dma_data(PUARTDEF def, const void* data, size_t len)
{
    if (def->buff)
    {
        ringbuff_write(def->buff, data, len);
    }
}

BOOL usart_rx_check(PUARTDEF def)
{
    BOOL    result  = false;
    size_t pos;

    /* Calculate current position in buffer */ //
    pos = CBRD_UART_IN_BUFF_SZ - __HAL_DMA_GET_COUNTER(def->def.hdmarx);

    if (pos != def->old_pos)
    {
        if (pos > def->old_pos)
        {
            // Current position is over previous one
            // We are in "linear" mode
            // Process data directly by subtracting "pointers"
            // process_dma_data(&usart_rx_dma_buffer[old_pos], pos - old_pos);
            process_dma_data(def, &def->dmarxbuff[def->old_pos], pos - def->old_pos);
        }
        else
        {
            // We are in "overflow" mode
            // First process data to the end of buffer
            process_dma_data(def, &def->dmarxbuff[def->old_pos], CBRD_UART_IN_BUFF_SZ - def->old_pos);
            /* Check and continue with beginning of buffer */
            if (pos)
            {
                process_dma_data(def, &def->dmarxbuff[0], pos);
            }
        }

        result = true;
    }

    def->old_pos = pos;                              // Save current position as old

    /* Check and manually update if we reached end of buffer */
    if (def->old_pos == CBRD_UART_IN_BUFF_SZ)
    {
        def->old_pos = 0;
    }

    return result;
}

// USART2_RX
void DMA1_Stream5_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&globalUarts[1].dmarx);
    usart_rx_check(&globalUarts[1]);
}
// USART3_RX
void DMA1_Stream1_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&globalUarts[2].dmarx);
    usart_rx_check(&globalUarts[2]);
}
// USART4_RX
void DMA1_Stream2_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&globalUarts[3].dmarx);
    usart_rx_check(&globalUarts[3]);
}
// USART5_RX
void DMA1_Stream0_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&globalUarts[4].dmarx);
    usart_rx_check(&globalUarts[4]);
}

