sf7ru/arsenal/beans/src/hal/stm32/f7xx/src/Stm32f7xxUart_freertos.c
    if (HAL_UART_Init(&tmp->def) == HAL_OK)
    {
        result = tmp;

        LL_USART_DisableIT_IDLE(tmp->addr);
//        __HAL_UART_ENABLE_IT(&tmp->def, UART_IT_PE);
        __HAL_UART_ENABLE_IT(&tmp->def, UART_IT_ERR);
        __HAL_UART_ENABLE_IT(&tmp->def, UART_IT_RXNE);
        //__HAL_UART_ENABLE_IT(&tmp->def, UART_IT_TC);
    }

    RETURN(result);
}
static PUARTDEF setSmartCardDef(PSERIALPROPSX   p,
                                PUARTDEF        tmp)
{
    PUARTDEF        result          = nil;

#ifdef HAL_SMARTCARD_MODULE_ENABLED

    ENTER(true);

    tmp->mode                              = MODE_SMARTCARD;
    tmp->scdef.Instance                    = tmp->addr;

    tmp->scdef.Init.BaudRate               = SERIALPROPS_UNBAUDRATE(p->p.u_baudrate) + p->extra;

    //tmp->scdef.Init.BaudRate = 10850;

    //printf("tmp->scdef.Init.BaudRate = %d\n", tmp->scdef.Init.BaudRate);

    switch (p->p.u_bits + 4)
    {
        default:    tmp->scdef.Init.WordLength = SMARTCARD_WORDLENGTH_9B;  break;
    }

    switch (p->p.u_stop)
    {
        case SERIALSTOP_half:           tmp->scdef.Init.StopBits  = SMARTCARD_STOPBITS_0_5; break;
        default:                        tmp->scdef.Init.StopBits  = SMARTCARD_STOPBITS_1_5; break;
    }

    switch (p->p.b_parity)
    {
        case SERIALPARITY_odd:          tmp->scdef.Init.Parity    = SMARTCARD_PARITY_ODD;   break;
        default:                        tmp->scdef.Init.Parity    = SMARTCARD_PARITY_EVEN;  break;
    }

    tmp->scdef.Init.Mode                    = SMARTCARD_MODE_TX_RX;
    tmp->scdef.Init.CLKPolarity             = p->clkPolarity == SERIALCLK_polarity_high  ? SMARTCARD_POLARITY_HIGH : SMARTCARD_POLARITY_LOW;
    tmp->scdef.Init.CLKPhase                = p->clkPhase    == SERIALCLK_phase_2nd_edge ? SMARTCARD_PHASE_2EDGE   : SMARTCARD_PHASE_1EDGE;
    tmp->scdef.Init.CLKLastBit              = SMARTCARD_LASTBIT_ENABLE;
#ifdef SMARTCARD_ONE_BIT_SAMPLE_DISABLE
    tmp->scdef.Init.OneBitSampling          = SMARTCARD_ONE_BIT_SAMPLE_DISABLE;
#endif
    tmp->scdef.Init.Prescaler               = (uint8_t)p->prescaller;
    tmp->scdef.Init.GuardTime               = 16;
#if defined(STM32F707xx)
    tmp->scdef.Init.NACKState               = SMARTCARD_NACK_ENABLE;
#else
    tmp->scdef.Init.NACKEnable              = SMARTCARD_NACK_ENABLE;
    tmp->scdef.Init.TimeOutEnable           = SMARTCARD_TIMEOUT_DISABLE;
    tmp->scdef.Init.BlockLength             = 0;
    tmp->scdef.Init.AutoRetryCount          = 0;
    tmp->scdef.AdvancedInit.AdvFeatureInit  = SMARTCARD_ADVFEATURE_NO_INIT;
#endif

    if (HAL_SMARTCARD_Init(&tmp->scdef) == HAL_OK)
    {
        result = tmp;

//        __HAL_SMARTCARD_DMA_REQUEST_ENABLE(&tmp->scdef, SMARTCARD_DMAREQ_RX);

        __HAL_SMARTCARD_ENABLE_IT(&tmp->scdef, SMARTCARD_IT_RXNE);
    }
#else

#endif

    RETURN(result);
}
PVOID _serial_open(PSERIALPROPS       p,
                   UINT               type,
                   PUINT              irqn)
{
    PVOID       result     = nil;
    PUARTDEF    tmp         = &globalUarts[p->u_port];

    if (p->u_flags & SERIALFLAG_lowpower)
    {
#ifdef LPUART1
        extern PVOID _lpuart_open(PSERIALPROPS,
                                  UINT,
                                  PUINT);

        result = _lpuart_open(p, type, irqn);
#endif
    }
    else
    {
        if (!tmp->buff && ((tmp->buff = ringbuff_create(CBRD_UART_IN_BUFF_SZ)) != nil))
        {
            if (_MspInit(p->u_port, type, p->u_flags))
            {
                switch (type)
                {
                    case SERIALTYPE_smartcard:
                    case SERIALTYPE_sc_secondary:
                        // FIXME remove destroy when IT for smartcard is impletented
                        SAFEDESTROY(ringbuff, tmp->buff);
                        result = setSmartCardDef((PSERIALPROPSX)p, tmp);
                        break;

                    default:
                        if (tmp->dmaStream != nil)
                        {
                            result = setUartDmaDef(p, tmp);
                        }
                        else
                            result = setUartDef(p, tmp);
                        break;
                }
            }
            if (!result)
            {
                _serial_close(tmp);
            }
        }
    }

    return result;
}
INT __serial_write(PVOID              internal,
                   PCVOID             data,
                   INT                size,
                   UINT               TO)
{
    INT         result  = -1;
    INT         rd;
    PUARTDEF    d       = (PUARTDEF)internal;
    char        buff [ 25 ];

    if (d->mode == MODE_SMARTCARD)
    {
#ifdef HAL_SMARTCARD_MODULE_ENABLED
        if (HAL_OK == HAL_SMARTCARD_Transmit(&d->scdef, data, size, TO))
        {
            result = size;
        }
#endif
    }
    else
    {
        if (TO)
        {
            switch (rd = HAL_UART_Transmit(&d->def, (uint8_t *) data, (uint16_t) size, TO))
            {
                case HAL_OK:
                    result = size;
                    break;

                default:
                    //                sprintf(buff, "err = %d", rd);
                    //                HAL_UART_AbortTransmit(&d->def);
                    break;
            }
        }
        else if (d->def.gState == HAL_UART_STATE_READY)
        {
            if (HAL_UART_Transmit_IT(&d->def, (uint8_t *) data, (uint16_t) size) == HAL_OK)
            {
                result = size;
            }
        }
        else
            result = 0;
    }

    return result;
}

INT __serial_read(PVOID              internal,
                  PCVOID             data,
                  INT                size,
                  UINT               TO)
{
    INT         result  = 0;
//    uint8_t *   on      = (uint8_t *)data;
    int         rd;
    U16         rxXferCountWas;
    PUARTDEF    d       = (PUARTDEF)internal;

    if (d->def.Instance->ISR == 0xF8)
    {
        __HAL_UART_ENABLE_IT(&d->def, UART_IT_ERR);
        __HAL_UART_ENABLE_IT(&d->def, UART_IT_RXNE);
    }

//    printf("Stm32l4xxUart.c(522): stage TO = %d\n", TO);

//    if (flag)
//    {
//        HAL_UART_Receive_DMA(&globalUarts[1].def, &usart_rx_dma_buffer, sizeof(usart_rx_dma_buffer));
//        flag = false;
//    }

    if (d->mode == MODE_SMARTCARD)
    {
#ifdef HAL_SMARTCARD_MODULE_ENABLED
        if (HAL_OK == HAL_SMARTCARD_Receive_IT(&d->scdef, data, size))
        {
            rxXferCountWas = d->scdef.RxXferCount;

            while (TO && d->scdef.RxXferCount && (HAL_SMARTCARD_STATE_READY != d->scdef.RxState))
            {
                if (rxXferCountWas == d->scdef.RxXferCount)
                {
                    TO--;
                }
                else
                    rxXferCountWas = d->scdef.RxXferCount;

                axsleep(1);
            }

            result = size - d->scdef.RxXferCount;

            HAL_SMARTCARD_AbortReceive_IT(&d->scdef);
        }
#endif
    }
    else
    {
        if (((result = ringbuff_read(d->buff, data, size)) == 0) && TO)
        {
            d->xTaskToNotify = xTaskGetCurrentTaskHandle();
            ulTaskNotifyTake(pdTRUE, TO);

            result = ringbuff_read(d->buff, data, size);
        }
    }


    return result;
}

//void clearPort0()
//{
//    __HAL_UART_ENABLE_IT(&globalUarts[0].def, UART_IT_ERR);
//    __HAL_UART_ENABLE_IT(&globalUarts[0].def, UART_IT_RXNE);
//
////    HAL_UART_Abort(&globalUarts[0].def);
//}
INT __serial_get_fd(PVOID internal)
{
    PUARTDEF    d       = (PUARTDEF)internal;
    //LPC_USART_T *   reqBase         = REQBASE(dev);

    return (INT)((d->mode == MODE_UART) ? &d->def : &d->scdef) ;
}

#endif